Обработки/Reports/_РеестрОплатКомиссийПИФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РеестрОплатКомиссийПИФ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РеестрОплатКомиссийПИФ/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Реестр оплат комиссий ПИФ (по форме ЦБ)",
		"0.10",
		"",
		Истина
	);
		
	// Команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();
	РегистрационныеДанные.Вставить("Команды", Команды);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация"					, ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДатаНачала"					, ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания"				, ЭтотОбъект.Период.ДатаОкончания);
	
	ИсключаемыеВидыДвиженияДенежныхСредств = Новый Массив;
	ИсключаемыеВидыДвиженияДенежныхСредств.Добавить(Перечисления.ВидыДвиженийДенежныхСредств.ВариационнаяМаржа);
	ИсключаемыеВидыДвиженияДенежныхСредств.Добавить(Перечисления.ВидыДвиженийДенежныхСредств.ВариационнаяМаржа);
	ИсключаемыеВидыДвиженияДенежныхСредств.Добавить(Перечисления.ВидыДвиженийДенежныхСредств.ВводДенежныхСредств);
	ИсключаемыеВидыДвиженияДенежныхСредств.Добавить(Перечисления.ВидыДвиженийДенежныхСредств.ВыводДенежныхСредств);
	ИсключаемыеВидыДвиженияДенежныхСредств.Добавить(Перечисления.ВидыДвиженийДенежныхСредств.ЗакрытиеДепозитногоВклада);
	ИсключаемыеВидыДвиженияДенежныхСредств.Добавить(Перечисления.ВидыДвиженийДенежныхСредств.Корректировка);
	ИсключаемыеВидыДвиженияДенежныхСредств.Добавить(Перечисления.ВидыДвиженийДенежныхСредств.ОплатаКупона);
	ИсключаемыеВидыДвиженияДенежныхСредств.Добавить(Перечисления.ВидыДвиженийДенежныхСредств.ПереводДенежныхСредств);
	ИсключаемыеВидыДвиженияДенежныхСредств.Добавить(Перечисления.ВидыДвиженийДенежныхСредств.ПриходПроцентовМНО);
	ИсключаемыеВидыДвиженияДенежныхСредств.Добавить(Перечисления.ВидыДвиженийДенежныхСредств.ПриходПроцентовПоДепозитномуВкладу);
	ИсключаемыеВидыДвиженияДенежныхСредств.Добавить(Перечисления.ВидыДвиженийДенежныхСредств.ПриходПроцентовСМО);
	ИсключаемыеВидыДвиженияДенежныхСредств.Добавить(Перечисления.ВидыДвиженийДенежныхСредств.РазмещениеДенежныхСредствНаДепозитномВкладе);
	
	Запрос.УстановитьПараметр("ИсключаемыеВидыДвиженияДенежныхСредств", ИсключаемыеВидыДвиженияДенежныхСредств);
	
	ИсключаемыеВариантыДвиженияДенежныхСредств = Новый Массив;
	ИсключаемыеВариантыДвиженияДенежныхСредств.Добавить(Справочники.ВидыЗадолженности.ПоНачислениюДивидендовАкции);
	ИсключаемыеВариантыДвиженияДенежныхСредств.Добавить(Справочники.ВидыЗадолженности.ПоСделке);
	ИсключаемыеВариантыДвиженияДенежныхСредств.Добавить(Справочники.ВидыЗадолженности.ПоВторойЧастиРЕПО);
	ИсключаемыеВариантыДвиженияДенежныхСредств.Добавить(Справочники.ВидыЗадолженности.ПоПервойЧастиРЕПО);
	ИсключаемыеВариантыДвиженияДенежныхСредств.Добавить(Справочники.ВидыЗадолженности.ПоНачислениюДивидендовПаи);
	
	Запрос.УстановитьПараметр("ИсключаемыеВариантыДвиженияДенежныхСредств"	, ИсключаемыеВариантыДвиженияДенежныхСредств);
	Запрос.УстановитьПараметр("ТаблицаСоответствияВидовКомиссий"			, ПолучитьСоответсвиеВидовКомиссий()); 
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(ТаблицаСоответствияВидовКомиссий.Наименование КАК СТРОКА(150)) КАК Наименование,
		|	ТаблицаСоответствияВидовКомиссий.ВидДвиженияДенежныхСредств КАК ВидДвиженияДенежныхСредств,
		|	ТаблицаСоответствияВидовКомиссий.ВариантДвиженияДенежныхСредств КАК ВариантДвиженияДенежныхСредств,
		|	ВЫРАЗИТЬ(ТаблицаСоответствияВидовКомиссий.Комментарий КАК СТРОКА(50)) Комментарий
		|ПОМЕСТИТЬ ТаблицаСоответствияВидовКомиссий
		|ИЗ
		|	&ТаблицаСоответствияВидовКомиссий КАК ТаблицаСоответствияВидовКомиссий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОстаткиДенежныхСредств.Период КАК Дата,
		|	ЕСТЬNULL(ТаблицаСоответствияВидовКомиссий.Наименование, ""Прочее"") КАК Наименование,
		|	ОстаткиДенежныхСредств.Сумма КАК Сумма,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТаблицаСоответствияВидовКомиссий.Комментарий, """") = """"
		|			ТОГДА ПОДСТРОКА(ОстаткиДенежныхСредств.Регистратор.Комментарий, 1, 250)
		|		ИНАЧЕ ТаблицаСоответствияВидовКомиссий.Комментарий
		|	КОНЕЦ КАК Комментарий,
		|	ОстаткиДенежныхСредств.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСоответствияВидовКомиссий КАК ТаблицаСоответствияВидовКомиссий
		|		ПО ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств = ТаблицаСоответствияВидовКомиссий.ВидДвиженияДенежныхСредств
		|			И ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств = ТаблицаСоответствияВидовКомиссий.ВариантДвиженияДенежныхСредств
		|ГДЕ
		|	ОстаткиДенежныхСредств.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ОстаткиДенежныхСредств.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И НЕ ОстаткиДенежныхСредств.ВидДвиженияДенежныхСредств В (&ИсключаемыеВидыДвиженияДенежныхСредств)
		|	И НЕ ОстаткиДенежныхСредств.ВариантДвиженияДенежныхСредств В (&ИсключаемыеВариантыДвиженияДенежныхСредств)
		|	И ОстаткиДенежныхСредств.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Выборка);
		ДокументРезультат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Функция ПолучитьСоответсвиеВидовКомиссий()
	
	ТаблицаСоответствияВидовКомиссий = Новый ТаблицаЗначений;
	ТаблицаСоответствияВидовКомиссий.Колонки.Добавить("Наименование"					, Новый ОписаниеТипов("Строка"));
	ТаблицаСоответствияВидовКомиссий.Колонки.Добавить("ВидДвиженияДенежныхСредств"		, Метаданные.РегистрыНакопления.ОстаткиДенежныхСредств.Реквизиты.ВидДвиженияДенежныхСредств.Тип);
	ТаблицаСоответствияВидовКомиссий.Колонки.Добавить("ВариантДвиженияДенежныхСредств"	, Метаданные.РегистрыНакопления.ОстаткиДенежныхСредств.Реквизиты.ВариантДвиженияДенежныхСредств.Тип);
	ТаблицаСоответствияВидовКомиссий.Колонки.Добавить("Комментарий"						, Новый ОписаниеТипов("Строка"));
	
	Макет = ПолучитьМакет("СоответствиеВидамКомиссий");
	
	Для НомерСтроки = 2 По Макет.ВысотаТаблицы Цикл
		НоваяСтрока = ТаблицаСоответствияВидовКомиссий.Добавить();
		НоваяСтрока.Наименование					= СокрЛП(Макет.Область(НомерСтроки, 1, НомерСтроки, 1).Текст);
		НоваяСтрока.Комментарий						= СокрЛП(Макет.Область(НомерСтроки, 5, НомерСтроки, 5).Текст);
		НоваяСтрока.ВидДвиженияДенежныхСредств		= Перечисления.ВидыДвиженийДенежныхСредств[СокрЛП(Макет.Область(НомерСтроки, 2, НомерСтроки, 2).Текст)];
		
		ТипВарианта = СокрЛП(Макет.Область(НомерСтроки, 4, НомерСтроки, 4).Текст);
		Если СтрНачинаетсяС(ТипВарианта, "Справочник") Тогда
			НоваяСтрока.ВариантДвиженияДенежныхСредств	= Справочники[СтрЗаменить(ТипВарианта, "Справочники.", "")][СокрЛП(Макет.Область(НомерСтроки, 3, НомерСтроки, 3).Текст)];
		ИначеЕсли СтрНачинаетсяС(ТипВарианта, "Перечисление") Тогда
			НоваяСтрока.ВариантДвиженияДенежныхСредств	= Перечисления[СтрЗаменить(ТипВарианта, "Перечисление.", "")][СокрЛП(Макет.Область(НомерСтроки, 3, НомерСтроки, 3).Текст)];
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаСоответствияВидовКомиссий;
	
КонецФункции
